<?php
$x = 5;
$x +=3;
echo $x . "<br>";

//------------------

$a = 10;
$b = 7;
echo $a / $b . "<br>";

//-------------------

$name = "Алиса";
$age = 25;
echo "Меня зовут {$name} и мне {$age} лет <br>";

//--------------------

$y = 12;
$y *=2;
echo $y . "<br>";

//---------------------

$x = 6;
$y = 4;
echo $x * $y . "<br>";

//----------------------

$a =7;
$b = 3;
echo $a + $b . "<br>";

//-----------------------

$str = "Ура!";
echo $str . " Мне нравится программирование<br>";

//------------------------

$a = 2;
$a++;
echo $a . "<br>";

//-------------------------

$str1 = "hello, ";
$str2 = "world!<br>";
echo $str1,$str2 . "<br>";

//-------------------------

$str = "one";
$number = 1;
$result = (int)$str + $number;
echo $result . "<br>";


